[
  {
    "id": "how-to-meditate-gods-way-2025-11-09",
    "title": "How to Meditate God's Way",
    "date": "2025-11-09",
    "speaker": "Bishop Dr. Darlingston Johnson",
    "scripture": "Joshua 1:8, Romans 12:1-2, Psalm 1:1-3, Proverbs 23:7",
    "youtubeUrl": "https://www.youtube.com/watch?v=d0aNue0ZCAk",
    "summary": "Bishop Dr. Darlingston Johnson delivers a transformative teaching on biblical meditation as God's chosen method for spiritual transformation and success. Moving beyond mere reading to deep meditation, the bishop teaches that meditation is sustained focus on God's Word that transforms the way we think, believe, and behave. Using practical frameworks like the MUSE acronym (Muse, Mutter, Mouth, Memorize) and the MEDITATE process, he provides actionable steps for moving God's Word from head to heart through imagination, visualization, and repetition. The message emphasizes that meditation is both prayer and worship, and fuels all other spiritual disciplines.",
    "keyPoints": [
      "Biblical meditation is God's chosen method for transformation and fulfilling divine assignments",
      "Reading gives information; meditation produces transformation",
      "Brain rewiring through God's Word - thoughts change neural pathways (Proverbs 23:7)",
      "MUSE framework: Muse silently, Mutter softly, Mouth it strongly, Memorize it",
      "MEDITATE process: Make time, Embrace silence, Determine focus, Internalize, Talk with God, Apply truth, Think on it, Enjoy",
      "Power of imagination and visualization to internalize Scripture (head to heart to hands to habits)",
      "Tree by rivers of water: stability, fruitfulness, and prosperity through meditation (Psalm 1:1-3)",
      "Meditation sets prayer and worship on fire - empowers all spiritual practices",
      "Day and night meditation as a lifestyle practice for success in God's assignment (Joshua 1:8)",
      "Exchange your thoughts for God's thoughts through sustained meditation"
    ],
    "transcriptPath": "transcripts/sermon/How_to_Meditate_God's_Way__Bishop_Darlingston_Johnson/transcript.md",
    "presentationPath": "presentations/How_to_Meditate_Gods_Way_Presentation.html",
    "summaryPath": "transcripts/sermon/How_to_Meditate_God's_Way__Bishop_Darlingston_Johnson/sermon_summary_and_prayer_points.md",
    "prayerPointsPath": "transcripts/sermon/How_to_Meditate_God's_Way__Bishop_Darlingston_Johnson/sermon_summary_and_prayer_points.md"
  },
  {
    "id": "biblical-meditation-2025-11-02",
    "title": "Biblical Meditation - The Key to Success",
    "date": "2025-11-02",
    "speaker": "Bishop Dr. Darlingston Johnson",
    "scripture": "Joshua 1:8",
    "youtubeUrl": "https://youtu.be/kk-CAOqouJU",
    "summary": "This powerful sermon focuses on biblical meditation as the most critical spiritual discipline for believers. Bishop Johnson teaches that meditation is essential for fulfilling God's purpose and achieving spiritual success. He emphasizes that meditation is both prayer and worship, and it's the fuel that empowers all other spiritual practices. The bishop provides practical instruction on moving God's Word from the head to the heart through sustained meditation, using memorable illustrations like thermostats, sponges, and tea bags to explain the process.",
    "keyPoints": [
      "Meditation is the most important spiritual discipline for fulfilling God's purpose",
      "The Word must move from head to heart through meditation for transformation",
      "Everyone already knows how to meditate (through worrying) - just redirect it to God's Word",
      "The mind is like a thermostat that you can reset through meditation",
      "Meditation is both prayer and worship - it sets all other spiritual disciplines on fire",
      "Practical steps: Read, review, rehearse, repeat, and visualize yourself living the truth",
      "What you meditate on determines what your mind produces (Romans 8:6)",
      "Meditation leads to prosperity and success in God's assignment (Joshua 1:8)"
    ],
    "transcriptPath": "transcripts/sermon/Sunday_Nov_2_2025_Bishop_Darlingston_Johnson.md",
    "presentationPath": "presentations/Biblical_Meditation_The_Key_to_Success_Presentation.html",
    "summaryPath": "sermons_summaries/Biblical_Meditation_The_Key_to_Success_Summary.md",
    "prayerPointsPath": "prayer_points/2025/Biblical_Meditation_Prayer_Points.md"
  },
  {
    "id": "you-must-be-born-again-2025-10-27",
    "title": "You MUST Be Born Again! (Kuku-jumuku)",
    "date": "2025-10-27",
    "speaker": "Pastor Zangai Peabody",
    "scripture": "John 3:1-12, Romans 5:12, 1 Corinthians 2:14, 1 Peter 1:23",
    "youtubeUrl": "https://youtu.be/m8cM1J3Ryf0",
    "summary": "An uncompromising message that being born again is not optional but essential for entering God's kingdom. If you're not inside, you can't know - discover the transformative power of spiritual rebirth through God's incorruptible Word.",
    "keyPoints": [
      "Spiritual death inherited from Adam affects all humanity",
      "The natural man cannot receive spiritual things (1 Cor 2:14)",
      "New birth through God's incorruptible Word (1 Peter 1:23)",
      "Kingdom of God is righteousness, peace, and joy in the Holy Spirit",
      "Authority and boldness of the born-again believer",
      "Being led by the Spirit as sons of God (Romans 8:14)",
      "Choice: remaining in Adam or being in Christ",
      "Righteousness is imputed, not earned (2 Corinthians 5:21)"
    ],
    "transcriptPath": "transcripts/sermon/You_MUST_Be_Born_Again__Pastor_Zangai_Peabody.md",
    "presentationPath": "presentations/You_MUST_Be_Born_Again_Presentation.html",
    "summaryPath": "sermons_summaries/You_MUST_Be_Born_Again__Pastor_Zangai_Peabody__2025-10-27.md"
  },
  {
    "id": "secret-of-victory-2025-10-20",
    "title": "The Secret of Victory Over Sin, Satan And Self",
    "date": "2025-10-20",
    "speaker": "Bishop Dr. Darlingston Johnson",
    "scripture": "Romans 6:1-14",
    "series": "Salvation Explained: From Guilt to Glory (Part 4)",
    "youtubeUrl": "https://youtu.be/fNz0cyWKvqU",
    "summary": "This powerful sermon reveals that the Christian life is not about striving to achieve victory over sin, Satan, and self through human willpower, but about letting the victory that Christ has already won work itself out in our lives through our identification and union with Him. Bishop Johnson teaches that believers are not called to 'die to sin' but to recognize that they are already dead to sin and alive to God through their union with Christ.",
    "keyPoints": [
      "Victory comes through letting, not fighting - faith not willpower",
      "Our identification with Christ - united in His death, burial, and resurrection",
      "We ARE dead to sin - already accomplished, not trying to achieve it",
      "We ARE alive to God - Christ breathing spiritual life into us",
      "Four steps to walking in victory: KNOW, RECKON, LET NOT, PRESENT",
      "The problem was death; the solution is life in Christ",
      "Union with Christ - spiritually real, not metaphorical",
      "Victory is standing IN Christ's accomplished work, not fighting FOR victory"
    ],
    "transcriptPath": "transcripts/sermon/The_Secret_of_Victory_Over_Sin,_Satan_And_Self__Bishop_Darlingston_Johnson/transcript.md",
    "presentationPath": "presentations/The_Secret_of_Victory_Over_Sin_Presentation.html",
    "summaryPath": "sermons_summaries/The_Secret_of_Victory_Over_Sin_Satan_And_Self_Summary.md",
    "prayerPointsPath": "prayer_points/2025/Week-2025-10-20_Victory_Over_Sin.md"
  },
  {
    "id": "a-steadfast-hope-2025-10-13",
    "title": "A Steadfast Hope",
    "date": "2025-10-13",
    "speaker": "Bishop Dr. Darlingston Johnson",
    "scripture": "Romans 5:1-5, Hebrews 6:13-20",
    "series": "Salvation Explained: From Guilt to Glory (Part 3)",
    "youtubeUrl": "https://youtu.be/6XDUe-nktx4",
    "summary": "Bishop Johnson teaches about the third treasure of salvation - hope - focusing on how believers have a steadfast and secure hope anchored in Jesus Christ. Unlike earthly anchors (money, jobs, relationships, health) that can fail, the hope believers have in Christ is immutable and guaranteed by God's promise and oath, providing stability through life's storms and leading to eternal glorification.",
    "keyPoints": [
      "Steadfast hope as essential to life - hope compared to water and air",
      "Christ as the believer's anchor - Jesus Himself is the anchor for the soul",
      "God's immutable promise and oath - double guarantee makes hope absolutely certain",
      "Glorification: the ultimate hope - complete conformity to Christ's image eternally",
      "Union with Christ - believers united with Christ in death, burial, resurrection, and ascension",
      "Victory over tribulation - present sufferings are temporary; eternal destiny is secure",
      "God's sovereign protection - God's investment in redemption guarantees security",
      "Self-encouragement through God's Word - speaking truth to ourselves rather than listening to negative thoughts"
    ],
    "transcriptPath": "transcripts/sermon/A_Steadfast_Hope_Bishop_Darlingston_Johnson_2025-10-13.txt",
    "presentationPath": "presentations/A_Steadfast_Hope_Presentation.html",
    "summaryPath": "sermons_summaries/A_Steadfast_Hope_Summary.md"
  },
  {
    "id": "do-you-love-me-more-than-these-2025-10-06",
    "title": "Do You Love Me More Than These?: A Call To Radical Discipleship",
    "date": "2025-10-06",
    "speaker": "Pastor Maima Moore",
    "church": "Harvest Intercontinational Church - Olney",
    "scripture": "John 21:15-22",
    "youtubeUrl": "https://youtu.be/WlPrqfk1Tvg",
    "summary": "Pastor Maima Moore delivers a powerful call to radical discipleship using Jesus' restoration of Peter as a framework. The message challenges believers to examine their love for Christ and willingness to serve in God's power. Like the Marines' slogan 'A Few Good Men,' Jesus is seeking willing disciples who will answer His call with wholehearted devotion, willing to pay the cost and focus on their own calling without comparison to others.",
    "keyPoints": [
      "The call to willing troops in the day of God's power (Psalm 110:3)",
      "Love as the foundation of all Christian service and discipleship",
      "Jesus restores Peter after his denial - from failure to faithfulness",
      "Love expressed through obedience and shepherding God's people",
      "The cost of radical discipleship - following Jesus may lead to suffering",
      "Focus on your own calling without comparing yourself to others",
      "God seeks a few good men and women who will be willing when He calls",
      "Supreme love for Christ must surpass all other loves and loyalties"
    ],
    "transcriptPath": "transcripts/sermon/Do_You_Love_Me_More_Than_These_A_Call_To_Radical_Discipleship__Pastor_Maima_Moore/transcript.md",
    "presentationPath": "presentations/Do_You_Love_Me_More_Than_These_Presentation.html",
    "summaryPath": "sermons_summaries/Do_You_Love_Me_More_Than_These_A_Call_To_Radical_Discipleship_Summary.md"
  },
  {
    "id": "three-treasures-justification-2025-09-29",
    "title": "Three Treasures of Justification",
    "date": "2025-09-29",
    "speaker": "Bishop Darlingston Johnson",
    "scripture": "Romans 5:1-5",
    "series": "Salvation Explained: From Guilt to Glory (Part 2)",
    "youtubeUrl": "https://youtu.be/zFhzdk9LgVU",
    "summary": "Bishop Johnson delivers a powerful exposition on justification - being declared righteous before God through faith in Jesus Christ. This sermon unpacks the three precious treasures that come with justification: Peace with God (the war is over), Access to Grace (standing in unmerited favor), and Hope that does not disappoint (the anchor of our soul). The message emphasizes the legal nature of salvation and the permanence of our standing before God.",
    "keyPoints": [
      "The gospel crisis - many unclear on how salvation works",
      "Justification defined - declared righteous by faith, not works",
      "The legal nature of justification - God followed His own law perfectly",
      "Treasure 1: Peace with God - complete reconciliation, hostilities ended",
      "Treasure 2: Access to Grace - standing in God's favor moment by moment",
      "Treasure 3: Hope that does not disappoint - eternal security and future glory",
      "Salvation is by grace through faith alone - not by works",
      "The verdict of 'not guilty' is everlasting and cannot be reversed"
    ],
    "transcriptPath": "transcript-viewer.html?id=three-treasures-justification-2025-09-29",
    "presentationPath": "presentations/Three_Treasures_of_Justification_Presentation.html",
    "prayerPointsPath": "prayer-viewer.html?id=three-treasures-justification-2025-09-29"
  },
  {
    "id": "gospel-of-grace-2025-09-21",
    "title": "The Gospel of Grace",
    "date": "2025-09-21",
    "speaker": "Pastor",
    "scripture": "Romans 5:1-2",
    "summary": "A powerful message about Jesus as the Peace Child who legally secured our peace with God. The sermon emphasizes that salvation is not emotional but legal - Christ satisfied every requirement of the law. Using the prodigal son story, it illustrates how God treats believers as though they never sinned, never rebelled, never left home.",
    "keyPoints": [
      "The Peace Child story - ending the war between God and humanity",
      "Our legal standing before God through Christ's sacrifice",
      "God is not just neutral but actively FOR us (Romans 8:31)",
      "The prodigal son - picture of complete restoration",
      "Access to transforming grace that changes us from inside out",
      "Nothing can separate us from God's love (Romans 8:38-39)"
    ],
    "transcriptPath": "transcript-viewer.html?id=gospel-of-grace-2025-09-21",
    "presentationPath": "presentations/Gospel_of_Grace_Presentation.html",
    "prayerPointsPath": "prayer-viewer.html?id=gospel-of-grace-2025-09-21"
  }
]