[
  {
    "path": "content/sermons_summaries/README.md",
    "title": "README",
    "speaker": null,
    "date": null
  },
  {
    "id": "three-treasures-justification-2025-09-29",
    "title": "Three Treasures of Justification",
    "date": "2025-09-29",
    "speaker": "Bishop Darlingston Johnson",
    "scripture": "Romans 5:1-5",
    "series": "Salvation Explained: From Guilt to Glory (Part 2)",
    "youtubeUrl": "https://youtu.be/zFhzdk9LgVU",
    "summary": "Bishop Johnson delivers a powerful exposition on justification - being declared righteous before God through faith in Jesus Christ. This sermon unpacks the three precious treasures that come with justification: Peace with God (the war is over), Access to Grace (standing in unmerited favor), and Hope that does not disappoint (the anchor of our soul). The message emphasizes the legal nature of salvation and the permanence of our standing before God.",
    "keyPoints": [
      "The gospel crisis - many unclear on how salvation works",
      "Justification defined - declared righteous by faith, not works",
      "The legal nature of justification - God followed His own law perfectly",
      "Treasure 1: Peace with God - complete reconciliation, hostilities ended",
      "Treasure 2: Access to Grace - standing in God's favor moment by moment",
      "Treasure 3: Hope that does not disappoint - eternal security and future glory",
      "Salvation is by grace through faith alone - not by works",
      "The verdict of 'not guilty' is everlasting and cannot be reversed"
    ],
    "transcriptPath": "transcript-viewer.html?id=three-treasures-justification-2025-09-29",
    "presentationPath": "presentations/Three_Treasures_of_Justification_Presentation.html",
    "prayerPointsPath": "prayer-viewer.html?id=three-treasures-justification-2025-09-29"
  },
  {
    "id": "gospel-of-grace-2025-09-21",
    "title": "The Gospel of Grace",
    "date": "2025-09-21",
    "speaker": "Pastor",
    "scripture": "Romans 5:1-2",
    "summary": "A powerful message about Jesus as the Peace Child who legally secured our peace with God. The sermon emphasizes that salvation is not emotional but legal - Christ satisfied every requirement of the law. Using the prodigal son story, it illustrates how God treats believers as though they never sinned, never rebelled, never left home.",
    "keyPoints": [
      "The Peace Child story - ending the war between God and humanity",
      "Our legal standing before God through Christ's sacrifice",
      "God is not just neutral but actively FOR us (Romans 8:31)",
      "The prodigal son - picture of complete restoration",
      "Access to transforming grace that changes us from inside out",
      "Nothing can separate us from God's love (Romans 8:38-39)"
    ],
    "transcriptPath": "transcript-viewer.html?id=gospel-of-grace-2025-09-21",
    "presentationPath": "presentations/Gospel_of_Grace_Presentation.html",
    "prayerPointsPath": "prayer-viewer.html?id=gospel-of-grace-2025-09-21"
  },
  {
    "id": "do-you-love-me-more-than-these-2025-10-06",
    "title": "Do You Love Me More Than These?: A Call To Radical Discipleship",
    "date": "2025-10-06",
    "speaker": "Pastor Maima Moore",
    "church": "Harvest Intercontinental Church - Olney",
    "scripture": "John 21:15-22",
    "youtubeUrl": "https://youtu.be/WlPrqfk1Tvg",
    "summary": "Pastor Maima Moore delivers a powerful call to radical discipleship using Jesus' restoration of Peter as a framework. The message challenges believers to examine their love for Christ and willingness to serve in God's power. Like the Marines' slogan 'A Few Good Men,' Jesus is seeking willing disciples who will answer His call with wholehearted devotion, willing to pay the cost and focus on their own calling without comparison to others.",
    "keyPoints": [
      "The call to willing troops in the day of God's power (Psalm 110:3)",
      "Love as the foundation of all Christian service and discipleship",
      "Jesus restores Peter after his denial - from failure to faithfulness",
      "Love expressed through obedience and shepherding God's people",
      "The cost of radical discipleship - following Jesus may lead to suffering",
      "Focus on your own calling without comparing yourself to others",
      "God seeks a few good men and women who will be willing when He calls",
      "Supreme love for Christ must surpass all other loves and loyalties"
    ],
    "transcriptPath": "transcripts/sermon/Do_You_Love_Me_More_Than_These_A_Call_To_Radical_Discipleship__Pastor_Maima_Moore/transcript.md",
    "presentationPath": "presentations/Do_You_Love_Me_More_Than_These_Presentation.html",
    "summaryPath": "sermons_summaries/Do_You_Love_Me_More_Than_These_A_Call_To_Radical_Discipleship_Summary.md"
  },
  {
    "id": "a-steadfast-hope-2025-10-13",
    "title": "A Steadfast Hope",
    "date": "2025-10-13",
    "speaker": "Bishop Dr. Darlingston Johnson",
    "scripture": "Romans 5:1-5, Hebrews 6:13-20",
    "series": "Salvation Explained: From Guilt to Glory (Part 3)",
    "youtubeUrl": "https://youtu.be/6XDUe-nktx4",
    "summary": "Bishop Johnson teaches about the third treasure of salvation - hope - focusing on how believers have a steadfast and secure hope anchored in Jesus Christ. Unlike earthly anchors (money, jobs, relationships, health) that can fail, the hope believers have in Christ is immutable and guaranteed by God's promise and oath, providing stability through life's storms and leading to eternal glorification.",
    "keyPoints": [
      "Steadfast hope as essential to life - hope compared to water and air",
      "Christ as the believer's anchor - Jesus Himself is the anchor for the soul",
      "God's immutable promise and oath - double guarantee makes hope absolutely certain",
      "Glorification: the ultimate hope - complete conformity to Christ's image eternally",
      "Union with Christ - believers united with Christ in death, burial, resurrection, and ascension",
      "Victory over tribulation - present sufferings are temporary; eternal destiny is secure",
      "God's sovereign protection - God's investment in redemption guarantees security",
      "Self-encouragement through God's Word - speaking truth to ourselves rather than listening to negative thoughts"
    ],
    "transcriptPath": "transcripts/sermon/A_Steadfast_Hope_Bishop_Darlingston_Johnson_2025-10-13.txt",
    "presentationPath": "presentations/A_Steadfast_Hope_Presentation.html",
    "summaryPath": "sermons_summaries/A_Steadfast_Hope_Summary.md"
  }
]