[
  {
    "path": "content/sermons_summaries/README.md",
    "title": "README",
    "speaker": null,
    "date": null
  },
  {
    "id": "three-treasures-justification-2025-09-29",
    "title": "Three Treasures of Justification",
    "date": "2025-09-29",
    "speaker": "Bishop Darlingston Johnson",
    "scripture": "Romans 5:1-5",
    "series": "Salvation Explained: From Guilt to Glory (Part 2)",
    "youtubeUrl": "https://youtu.be/zFhzdk9LgVU",
    "summary": "Bishop Johnson delivers a powerful exposition on justification - being declared righteous before God through faith in Jesus Christ. This sermon unpacks the three precious treasures that come with justification: Peace with God (the war is over), Access to Grace (standing in unmerited favor), and Hope that does not disappoint (the anchor of our soul). The message emphasizes the legal nature of salvation and the permanence of our standing before God.",
    "keyPoints": [
      "The gospel crisis - many unclear on how salvation works",
      "Justification defined - declared righteous by faith, not works",
      "The legal nature of justification - God followed His own law perfectly",
      "Treasure 1: Peace with God - complete reconciliation, hostilities ended",
      "Treasure 2: Access to Grace - standing in God's favor moment by moment",
      "Treasure 3: Hope that does not disappoint - eternal security and future glory",
      "Salvation is by grace through faith alone - not by works",
      "The verdict of 'not guilty' is everlasting and cannot be reversed"
    ],
    "path": "../transcripts/sermon/Three_Treasures_of_Justification__Bishop_Darlingston_Johnson/transcript.md",
    "presentationPath": "presentations/Three_Treasures_of_Justification_Presentation.html",
    "prayerPointsPath": "../prayer_points/2025/Three_Treasures_of_Justification_Summary_and_Prayer.md"
  },
  {
    "id": "gospel-of-grace-2025-09-21",
    "title": "The Gospel of Grace",
    "date": "2025-09-21",
    "speaker": "Pastor",
    "scripture": "Romans 5:1-2",
    "summary": "A powerful message about Jesus as the Peace Child who legally secured our peace with God. The sermon emphasizes that salvation is not emotional but legal - Christ satisfied every requirement of the law. Using the prodigal son story, it illustrates how God treats believers as though they never sinned, never rebelled, never left home.",
    "keyPoints": [
      "The Peace Child story - ending the war between God and humanity",
      "Our legal standing before God through Christ's sacrifice",
      "God is not just neutral but actively FOR us (Romans 8:31)",
      "The prodigal son - picture of complete restoration",
      "Access to transforming grace that changes us from inside out",
      "Nothing can separate us from God's love (Romans 8:38-39)"
    ],
    "path": "../transcripts/sermon/Sermon_Sep_21_2025_Gospel_of_grace.md",
    "presentationPath": "presentations/Gospel_of_Grace_Presentation.html",
    "prayerPointsPath": "../prayer_points/2025/Week-2025-09-21_Gospel_of_Grace.md"
  }
]